package com.kh.oop.basic;

public class 객체 {
	/*
	
	OOP Object - Oriented - Programming
	컴퓨터 프로그램을 사용할 때 어떤 데이터를 입력 받아서 순서대로 처리하고 결과를 출력하는 부품들의 조합
	
	객체란, 데이터와 그 데이터를 처리하는 메서드를 함께 묶어놓은 파일
	
	클래스(Class)는 객체를 만들기 위한 템플릿 또는 설계도
		처음에 만들어 줄 때 작성한 파일명과 public class 에 작성한 파일명이 동일해야함
		파일을 외부에서 사용하고 싶다면 첫 글자를 소문자가 아니라 대문자로 작성해야함
		
		접근제한자
		public - 외부에서 접근 가능하도록 허용
		protected - 동일 패키지 또는 자식 메서드에서만 접근 가능 
		default - 동일 패키지에서만 접근 가능
		private - 외부에서 접근 불가능(내부 클래스에서만 접근 가능)
		
		클래스 에는 필드 와 생성자 메서드
		필드 : 변수명을 작성하는 공간, 속성이나 데이터를 저장한 후 객체의 상태를 나타내기도함
		생성자 : 클래스명과 동일하게 이름을 작성해야함, 객체를 초기화하는 특별한 종류의 메서드
			생성자를 작성하지 않아도 기본 생성자를 자동으로 제공
		메서드 : 클래스 내부에 동작이나 활동 상태를 작성하는 공간	
		
	*/
}
